app/controllers/meegens_controller.rb

  def index
    @meegens = Meegen.all
---
SELECT * FROM `meegens`

  def show
    @meegen = Meegen.find(params[:id])
---
SELECT * FROM `meegens` WHERE (`meegens`.`id` = 1)

  def create
    @meegen = Meegen.new(params[:meegen])
    @keywords =
      Keyword.find_all_by_name(params[:keyword_name])
    if @keywords.size > 0
      @meegen.tag_list.add @keywords.first.name
    else
      @keyword = Keyword.new(:name => params[:keyword_name])
      @keyword.save
      @meegen.tag_list.add @keyword.name
    end

    respond_to do |format|
      if @meegen.save
---
SELECT * FROM `keywords` WHERE (`keywords`.`name` = '希望') LIMIT 1
SELECT `tags`.id FROM `tags` WHERE (`tags`.`name` = BINARY '希望') LIMIT 1
INSERT INTO `keywords` (`name`, `updated_at`, `created_at`) VALUES('希望', '2009-07-31 11:44:54', '2009-07-31 11:44:54')
INSERT INTO `meegens` (`name`, `updated_at`, `created_at`) VALUES('希望さえあればどんな所にでも たどりつけると決心している。', '2009-07-31 11:31:22', '2009-07-31 11:31:22')
INSERT INTO `tags` (`name`) VALUES('希望')